{
  "backend/main.mo": "Actor canister managing pets, vaccinations, medications, and appointments with CRUD-style add and query functions using List collections.",
  "feature_evidence.json": "Feature-evidence report mapping features to impacted frontend files and associated components, tests, and confidence indicators.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of all major frontend files for documentation or build tooling.",
  "frontend/index.css": "Empty CSS file intended for global or legacy styles but currently containing no rules.",
  "frontend/index.html": "Base HTML template loading the React app entry point and defining metadata for the Pawfect Care site.",
  "frontend/src/App.tsx": "Minimal app component that renders the PawfectCareLanding page.",
  "frontend/src/components/icons/MobileInHandIcon.tsx": "SVG icon component rendering a hand holding a phone with signal waves.",
  "frontend/src/components/PawfectCareLanding.tsx": "Large landing-page component containing hero, services, testimonials, FAQs, and SafeImage-based media with navigation and branding UI.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a styled placeholder on load error while preserving layout size.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing a backend actor instance based on authenticated or anonymous identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for managing Internet Identity login state, identity persistence, and AuthClient behavior.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for the Chewy-blue theme plus SafeImage utility classes.",
  "frontend/src/lib/publicAssetUrl.ts": "Helper building base-path-safe URLs for static assets using Vite's BASE_URL.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugin integrations for project styling.",
  "project_state.json": "Stores project metadata, deployment goals, architectural notes, known issues, and feature definitions for build planning."
}