{
  "kind": "build_request",
  "title": "Restore Chewy-blue theme colors and update specific landing-page images",
  "projectName": "Pawfect Care",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Fix the production styling issue where the Pawfect Care landing page appears black-and-white by ensuring the intended Chewy-blue Tailwind theme variables are applied at runtime and are not overridden by conflicting/duplicate theme stylesheets (notably resolve any conflict between frontend/index.css and frontend/src/index.css).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The website doesnot have any colors its jus black and white , there were colors previously but now i dont see it i have asked you to use chewy blue colors in our previous conversation"
        ]
      },
      "acceptanceCriteria": [
        "In a production build, the page uses the Chewy-blue theme (primary buttons/links/accents are blue) and no longer renders as mostly black-and-white.",
        "Only one authoritative set of CSS variables for the Tailwind theme is applied at runtime (no duplicate/conflicting theme token definitions).",
        "Text and foreground colors remain readable across all sections (no invisible text due to foreground/background conflicts)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "In the “Happy Pets, Happy Hearts” section of frontend/src/components/PawfectCareLanding.tsx, keep only three images: the dog nail cutting image, the dog teeth cleaning image, and the dog ear cleaning image; remove all other images from that section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "for Happy Pets, Happy Hearts section keep only 3 happy pet  images",
          "keep image of dog with nail cutting, image of dog with teeth cleaning , image of dog with ear cleaning thats it",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "The “Happy Pets, Happy Hearts” section renders exactly 3 images (nail cutting, teeth cleaning, ear cleaning) on desktop and mobile.",
        "No additional images appear in that section after the change.",
        "Layout remains visually consistent (no broken spacing, empty gaps, or broken-image icons)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Replace the Bath & Brush service card image in the Services section of frontend/src/components/PawfectCareLanding.tsx with the newly uploaded image file image-20.png, using a base-path-safe asset URL strategy (publicAssetUrl) so it renders correctly in production.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-11"
        ],
        "quotes": [
          "Change the image of bath & brush to the one i shared now",
          "do you mean the Bath & Brush service card image in the Services section should be replaced with the newly uploaded image (image‑20.png)?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "image-20.png is included in the frontend static assets output and is referenced by the Bath & Brush service card.",
        "In production, the Bath & Brush image loads successfully (no 404) and no broken-image icon appears.",
        "The Bath & Brush card image sizing/cropping/spacing matches the other service card images (consistent aspect ratio and styling)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Rebuild and deploy the updated Pawfect Care Draft Version 2 frontend so the live production deployment includes the restored Chewy-blue colors and the specified image updates.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-13"
        ],
        "quotes": [
          "1. yes \n2. Yes",
          "Great — I’ll run the build again with all the updates exactly as confirmed."
        ]
      },
      "acceptanceCriteria": [
        "The live production site reflects the restored Chewy-blue theme colors.",
        "The live production site shows exactly 3 images in “Happy Pets, Happy Hearts” (nail cutting, teeth cleaning, ear cleaning).",
        "The live production site shows image-20.png on the Bath & Brush service card."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components); compose them instead.",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep backend as a single Motoko actor in backend/main.mo; only add migration logic if persistent state schema changes (not expected for this request).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new landing-page sections or new product features beyond fixing theme colors and the specified image changes.",
    "Do not change the overall Pawfect Care content strategy/copy except as required to implement the image removals/replacements.",
    "Do not introduce new authentication providers or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}