{
  "kind": "build_request",
  "title": "Fix broken uploaded images rendering in production",
  "projectName": "Pawfect Care",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Fix all broken image rendering on the live Pawfect Care landing page by ensuring every referenced image URL actually resolves in production (no 404s) and every image visibly renders in its intended section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "my images are still broken why \ncan youy fix it"
        ]
      },
      "acceptanceCriteria": [
        "Visiting the deployed site shows no broken-image icons/blank image containers in Hero, Overview, Services, and the end-of-page gallery.",
        "Browser DevTools Network tab shows 200 responses (no 404/ERR) for all image requests used by the landing page.",
        "All <img> elements in the landing page have non-empty, valid src values at runtime (no undefined/null/empty strings)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Audit and correct all image paths used in frontend/src/components/PawfectCareLanding.tsx so they work with the app’s deployed base path (avoid hard-coded absolute paths that break under different host/base configurations), while keeping the same visual layout and image placements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "my images are still broken why \ncan youy fix it"
        ]
      },
      "acceptanceCriteria": [
        "No image src in PawfectCareLanding relies on a deployment-breaking absolute path assumption (e.g., paths that fail when the app is not served at domain root).",
        "All images render correctly when the app is served from both root (/) and a non-root base path environment.",
        "No console errors related to failed image loads occur on initial page load."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Ensure all user-uploaded images required by the landing page are actually included in the frontend build output as static assets, including the newly uploaded image-18.png, and that filenames referenced in code exactly match files present in the built app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The user has uploaded 2 image(s): image-18.png, image-18.png."
        ]
      },
      "acceptanceCriteria": [
        "The built/deployed app contains the uploaded images at the exact paths referenced by the frontend.",
        "image-18.png is present as a static asset in the deployed app and can be loaded directly via its resolved URL without error.",
        "No references remain to image files that are missing from the project’s static assets."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add a safe UI fallback for any image that still fails to load (e.g., via an onError handler) so the page never shows a broken-image icon; instead, render a styled placeholder that matches the site theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "my images are still broken why \ncan youy fix it"
        ]
      },
      "acceptanceCriteria": [
        "If an image fails to load, the UI replaces it with a consistent themed placeholder (not the browser broken-image icon).",
        "The fallback preserves layout dimensions to avoid content jump/layout shift.",
        "Fallback behavior is applied to all landing page images (hero, overview grid, services cards, and gallery strip)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not introduce new backend services or external storage/CDNs; serve images as frontend static assets.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not redesign the landing page layout or change existing section content beyond what is necessary to fix image loading.",
    "Do not add new product features (e.g., new booking logic, authentication changes) as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}