{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Chewy-blue theme colors and update landing-page images (Pawfect Care)",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Resolve duplicate/conflicting Tailwind theme CSS so the Chewy-blue color variables apply in production (no black-and-white rendering).",
      "acceptanceCriteria": [
        "In a production build, the page uses the Chewy-blue theme (primary buttons/links/accents are blue) and no longer renders as mostly black-and-white.",
        "Only one authoritative set of CSS variables for the Tailwind theme is applied at runtime (no duplicate/conflicting theme token definitions).",
        "Text and foreground colors remain readable across all sections (no invisible text due to foreground/background conflicts)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Remove or neutralize the conflicting duplicate theme token definitions so this file no longer overrides the authoritative Chewy-blue variables applied by the app at runtime. Ensure there is a single source of truth for theme variables to prevent production overrides. (Selected components context: use the initial-app/build-template-react Tailwind/CSS setup as the baseline; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Confirm Chewy-blue theme variables are the authoritative runtime theme tokens (light/dark) and remain readable; adjust any variable definitions if needed to avoid foreground/background conflicts after removing stylesheet duplication. (Selected components context: aligns with initial-app Tailwind variable strategy; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify the document does not load an additional/global stylesheet that reintroduces duplicate theme variables (keep runtime styling driven by the app’s imported CSS only). Apply minimal changes only if an extra stylesheet reference is found/needed to prevent conflicts. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update the “Happy Pets, Happy Hearts” section to render exactly three images: nail cutting, teeth cleaning, and ear cleaning.",
      "acceptanceCriteria": [
        "The “Happy Pets, Happy Hearts” section renders exactly 3 images (nail cutting, teeth cleaning, ear cleaning) on desktop and mobile.",
        "No additional images appear in that section after the change.",
        "Layout remains visually consistent (no broken spacing, empty gaps, or broken-image icons)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PawfectCareLanding.tsx",
          "operation": "modify",
          "description": "In the “Happy Pets, Happy Hearts” section, remove all non-required images and keep only the three specified (dog nail cutting, dog teeth cleaning, dog ear cleaning). Ensure responsive layout still looks intentional (no empty grid slots) and uses existing SafeImage + publicAssetUrl patterns. (Uses shadcn-ui composed components already present; do not edit frontend/src/components/ui. Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Replace the Bath & Brush service card image with image-20.png using publicAssetUrl so it loads in production.",
      "acceptanceCriteria": [
        "image-20.png is included in the frontend static assets output and is referenced by the Bath & Brush service card.",
        "In production, the Bath & Brush image loads successfully (no 404) and no broken-image icon appears.",
        "The Bath & Brush card image sizing/cropping/spacing matches the other service card images (consistent aspect ratio and styling)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/image-20.png",
          "operation": "create",
          "description": "Add the newly uploaded Bath & Brush card image to the static public assets so it is included in production output."
        },
        {
          "path": "frontend/src/components/PawfectCareLanding.tsx",
          "operation": "modify",
          "description": "Update the Bath & Brush service card image source to use publicAssetUrl('/assets/image-20.png') and keep the same image container styling (aspect ratio/object-fit/hover effects) as the other service cards for consistent sizing. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Ensure the repository has clear build/deploy steps so the updated frontend can be rebuilt and deployed with the restored theme and image changes.",
      "acceptanceCriteria": [
        "The live production site reflects the restored Chewy-blue theme colors.",
        "The live production site shows exactly 3 images in “Happy Pets, Happy Hearts” (nail cutting, teeth cleaning, ear cleaning).",
        "The live production site shows image-20.png on the Bath & Brush service card."
      ],
      "file_operations": [
        {
          "path": "frontend/README.md",
          "operation": "create",
          "description": "Document the exact frontend rebuild and deployment steps/checks to validate the Chewy-blue theme and the two image updates in a production build (including verifying no duplicate theme CSS is shipped). Keep instructions aligned with the existing build-template-react/github-export-icp-cli setup. (Verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}